## Plan Result (635: prod_enterprise - TerraformPlanApply)




<pre><code>Plan: 38 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azuread_group.user_access_administrator[&#34;Security&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators[&#34;Security&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["CFT"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:CFT)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["CFT-NonProd"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:CFT-NonProd)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["CFT-Prod"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:CFT-Prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["CFT-Sandbox"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:CFT-Sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["Crime"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:Crime)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["HMCTS"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:HMCTS)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["Heritage"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:Heritage)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["Heritage-NonProd"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:Heritage-NonProd)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["Heritage-Prod"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:Heritage-Prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["Heritage-Sandbox"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:Heritage-Sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["Platform"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:Platform)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["Platform-NonProd"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:Platform-NonProd)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["Platform-Prod"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:Platform-Prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["Platform-Sandbox"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:Platform-Sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["SDS"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:SDS)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["SDS-NonProd"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:SDS-NonProd)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["SDS-Prod"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:SDS-Prod)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["SDS-Sandbox"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:SDS-Sandbox)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azuread_group.user_access_administrator["Security"] will be created
  + resource "azuread_group" "user_access_administrator" {
      + auto_subscribe_new_members     = (known after apply)
      + display_name                   = "DTS User Access Administrators (mg:Security)"
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + prevent_duplicate_names        = true
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + visibility                     = (known after apply)
      + writeback_enabled              = false
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["CFT"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["CFT-NonProd"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["CFT-Prod"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["CFT-Sandbox"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["Crime"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Crime"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["HMCTS"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["Heritage"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["Heritage-NonProd"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["Heritage-Prod"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["Heritage-Sandbox"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["Platform"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["Platform-NonProd"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["Platform-Sandbox"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["SDS"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["SDS-NonProd"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["SDS-Prod"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["SDS-Sandbox"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.user_access_administrators["Security"] will be created
  + resource "azurerm_role_assignment" "user_access_administrators" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "User Access Administrator"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Security"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 38 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 635: prod_enterprise - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":161,"Program":"tfcmt","SHA1":"","Target":"635: prod_enterprise - TerraformPlanApply","Vars":{}} -->